## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [1]:
import pandas as pd
import numpy as np
import requests as rq
import sqlite3
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile
import tarfile
import gzip

In [2]:
# Bom Movie Data
with gzip.open("zippedData/bom.movie_gross.csv.gz", "rb") as f:
    bom_movie_gross = pd.read_csv(f)

# IMDB Name Data    
with gzip.open("zippedData/imdb.name.basics.csv.gz", "rb") as f:
    imdb_name_basics = pd.read_csv(f)

with gzip.open("zippedData/imdb.title.akas.csv.gz", "rb") as f:
    imdb_title_akas = pd.read_csv(f)

with gzip.open("zippedData/imdb.title.basics.csv.gz", "rb") as f:
    imdb_title_basics = pd.read_csv(f)

with gzip.open("zippedData/imdb.title.crew.csv.gz", "rb") as f:
    imdb_title_crew = pd.read_csv(f)
    
with gzip.open("zippedData/imdb.title.principals.csv.gz", "rb") as f:
    imdb_title_principals = pd.read_csv(f)

with gzip.open("zippedData/imdb.title.ratings.csv.gz", "rb") as f:
    imdb_title_ratings = pd.read_csv(f)

# Rotten Tomatoes Movie Data
with gzip.open("zippedData/rt.movie_info.tsv.gz", "rb") as f:
    rt_movie_info = pd.read_csv(f, sep="\t", encoding='latin1')
    
with gzip.open("zippedData/rt.reviews.tsv.gz", "rb") as f:
    rt_reviews = pd.read_csv(f, sep="\t", encoding='latin1')

# TMDB Movie Data
with gzip.open("zippedData/tmdb.movies.csv.gz", "rb") as f:
    tmdb_movies = pd.read_csv(f)

# TN Movie Data
with gzip.open("zippedData/tn.movie_budgets.csv.gz", "rb") as f:
    tn_movie_budgets = pd.read_csv(f)

In [3]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [4]:
df = tn_movie_budgets

In [5]:
df['production_budget'] = df['production_budget'].str.replace(',','')
df['production_budget'] = df['production_budget'].str.replace('$','')
df['domestic_gross'] = df['domestic_gross'].str.replace(',','')
df['domestic_gross'] = df['domestic_gross'].str.replace('$','')
df['worldwide_gross'] = df['worldwide_gross'].str.replace(',','')
df['worldwide_gross'] = df['worldwide_gross'].str.replace('$','')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [11]:
df['production_budget'] = df['production_budget'].astype(int)
df['domestic_gross'] = df['domestic_gross'].astype(int)
df['worldwide_gross'] = df['worldwide_gross'].astype(int)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
dtypes: int64(4), object(2)
memory usage: 271.2+ KB

In [37]:
df_ww_sorted = df.sort_values('worldwide_gross', ascending = False)
df_ww_sorted.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2009
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,1997
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,2015
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,2018
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,2015

In [19]:
df['year'] = [date[-4:] for date in list(df['release_date'])]

AttributeError: 'list' object has no attribute 'astype'

In [28]:
df['year'] = df['year'].astype(int)
df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2009
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,2019
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017

In [41]:
df_ww_sorted.head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2009
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,1997
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,2015
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,2018
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,2015
66,67,"Apr 3, 2015",Furious 7,190000000,353007020,1518722794,2015
26,27,"May 4, 2012",The Avengers,225000000,623279547,1517935897,2012
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,2015
41,42,"Feb 16, 2018",Black Panther,200000000,700059566,1348258224,2018
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157,2011
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017
112,13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,2018
155,56,"Nov 22, 2013",Frozen,150000000,400738009,1272469910,2013
134,35,"Mar 17, 2017",Beauty and the Beast,160000000,504014165,1259199706,2017
43,44,"Jun 15, 2018",Incredibles 2,200000000,608581744,1242520711,2018
22,23,"Apr 14, 2017",The Fate of the Furious,250000000,225764765,1234846267,2017
47,48,"May 3, 2013",Iron Man 3,200000000,408992272,1215392272,2013
672,73,"Jul 10, 2015",Minions,74000000,336045770,1160336173,2015
135,36,"Dec 21, 2018",Aquaman,160000000,335061807,1146894640,2018
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,94000000,377845905,1141403341,2003

In [40]:
df_pb_sorted = df.sort_values('production_budget', ascending = False)
df_pb_sorted.head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2009
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,2019
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,2015
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,2018
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,300000000,309420425,963420425,2007
8,9,"Nov 17, 2017",Justice League,300000000,229024295,655945209,2017
9,10,"Nov 6, 2015",Spectre,300000000,200074175,879620923,2015
10,11,"Jul 20, 2012",The Dark Knight Rises,275000000,448139099,1084439099,2012
11,12,"May 25, 2018",Solo: A Star Wars Story,275000000,213767512,393151347,2018
12,13,"Jul 2, 2013",The Lone Ranger,275000000,89302115,260002115,2013
13,14,"Mar 9, 2012",John Carter,275000000,73058679,282778100,2012
14,15,"Nov 24, 2010",Tangled,260000000,200821936,586477240,2010
15,16,"May 4, 2007",Spider-Man 3,258000000,336530303,894860230,2007
17,18,"Mar 25, 2016",Batman v Superman: Dawn of Justice,250000000,330360194,867500281,2016
18,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,250000000,303003568,1017003568,2012
19,20,"Jul 15, 2009",Harry Potter and the Half-Blood Prince,250000000,302089278,935213767,2009
20,21,"Dec 13, 2013",The Hobbit: The Desolation of Smaug,250000000,258366855,960366855,2013

In [44]:
df['profit'] = df['worldwide_gross']-df['production_budget']
df.sort_values('profit', ascending = False).head(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year,profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2009,2351345279
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,1997,2008208395
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,2018,1748134200
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,2015,1747311220
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,2015,1433854864
66,67,"Apr 3, 2015",Furious 7,190000000,353007020,1518722794,2015,1328722794
26,27,"May 4, 2012",The Avengers,225000000,623279547,1517935897,2012,1292935897
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157,2011,1216693157
41,42,"Feb 16, 2018",Black Panther,200000000,700059566,1348258224,2018,1148258224
112,13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,2018,1135772799
155,56,"Nov 22, 2013",Frozen,150000000,400738009,1272469910,2013,1122469910
134,35,"Mar 17, 2017",Beauty and the Beast,160000000,504014165,1259199706,2017,1099199706
672,73,"Jul 10, 2015",Minions,74000000,336045770,1160336173,2015,1086336173
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,2015,1072413963
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,94000000,377845905,1141403341,2003,1047403341
43,44,"Jun 15, 2018",Incredibles 2,200000000,608581744,1242520711,2018,1042520711
47,48,"May 3, 2013",Iron Man 3,200000000,408992272,1215392272,2013,1015392272
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017,999721747
135,36,"Dec 21, 2018",Aquaman,160000000,335061807,1146894640,2018,986894640
22,23,"Apr 14, 2017",The Fate of the Furious,250000000,225764765,1234846267,2017,984846267

In [62]:
bom_movie_gross.sort_values('domestic_gross', ascending = False)

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,936700000.0,"1,131.6",2015
3080,Black Panther,BV,700100000.0,646900000,2018
3079,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018
1873,Jurassic World,Uni.,652300000.0,"1,019.4",2015
727,Marvel's The Avengers,BV,623400000.0,895500000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,NaN,49600000,2015
2392,Finding Mr. Right 2,CL,NaN,114700000,2016
2468,Solace,LGP,NaN,22400000,2016
2595,Viral,W/Dim.,NaN,552000,2016
2825,Secret Superstar,NaN,NaN,122000000,2017

In [71]:
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186